# Install everything with: brew bundle
# Casks adopt pre-existing apps that were installed manually before brew managed them.
cask_args adopt: true

tap "heroku/brew"
tap "peonping/tap"

# Shell & terminal
brew "chezmoi"
brew "zsh"
cask "wezterm"
cask "font-fira-code"

# Dev tools
brew "gh"
brew "gnupg" # needed for RVM key verification
brew "pyenv"
brew "pyenv-virtualenv"
brew "docker"
brew "heroku"
brew "markdownlint-cli"

# Claude Code
brew "peonping/tap/peon-ping"

# Apps
cask "visual-studio-code"
cask "dropbox"
cask "slack"
cask "spotify"
cask "vlc"
cask "gimp"

# Mac App Store
brew "mas"
mas "RunCat", id: 1_429_033_973
